# BuiltInFailures.TagFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TagFailures Class
BuiltInFailures Class Members See Also
---
Failures about Tag.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class TagFailures
```

Visual Basic
---
```text
Public NotInheritable Class TagFailures
```

Visual C++
---
```text
public ref class TagFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..TagFailures
# See Also
BuiltInFailures..::..TagFailures Members
Autodesk.Revit.DB Namespace